micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_eth.h
/** @defgroup ETH_Rx_L4_Filter_Status ETH Rx L4 Filter Status
  * @{
  */
#define ETH_L4_FILTER0_MATCH        ETH_DMARXNDESCWBF_L4FM
#define ETH_L4_FILTER1_MATCH        (ETH_DMARXNDESCWBF_L4FM | ETH_DMARXNDESCWBF_L3L4FM)
/**
  * @}
  */

/** @defgroup ETH_Rx_Error_Code ETH Rx Error Code
  * @{
  */
#define ETH_DRIBBLE_BIT_ERROR   ETH_DMARXNDESCWBF_DE
#define ETH_RECEIVE_ERROR       ETH_DMARXNDESCWBF_RE
#define ETH_RECEIVE_OVERFLOW    ETH_DMARXNDESCWBF_OE
#define ETH_WATCHDOG_TIMEOUT    ETH_DMARXNDESCWBF_RWT
#define ETH_GIANT_PACKET        ETH_DMARXNDESCWBF_GP
#define ETH_CRC_ERROR           ETH_DMARXNDESCWBF_CE
/**
  * @}
  */

/** @defgroup ETH_DMA_Arbitration ETH DMA Arbitration
  * @{
  */
#define ETH_DMAARBITRATION_TX        (ETH_DMAMR_TXPR)
/**
  * @}
  */

/** @defgroup ETH_DMA_Transmit_Arbitration_Algorithm ETH DMA Transmit Arbitration Algorithm
  * @{
  */
#define ETH_DMATXARBITRATION_FIXED_PRIO      (ETH_DMAMR_TAA_FP)
#define ETH_DMATXARBITRATION_WEIGHTED_SP     (ETH_DMAMR_TAA_WSP)
#define ETH_DMATXARBITRATION_WEIGHTED_RR     (ETH_DMAMR_TAA_WRR)
/**
  * @}
  */

/** @defgroup ETH_Burst_Mode ETH Burst Mode
  * @{
  */
#define ETH_BURSTLENGTH_FIXED           ETH_DMASBMR_FB
#define ETH_BURSTLENGTH_UNSPECIFIED     0x00000000U
/**
  * @}
  */

/** @defgroup ETH_BLEN_Size ETH Blen size
  * @{
  */
#define ETH_BLEN_MAX_SIZE_256             (ETH_DMASBMR_BLEN256 | ETH_BLEN_MAX_SIZE_128)
#define ETH_BLEN_MAX_SIZE_128             (ETH_DMASBMR_BLEN128 | ETH_BLEN_MAX_SIZE_64)
#define ETH_BLEN_MAX_SIZE_64              (ETH_DMASBMR_BLEN64 | ETH_BLEN_MAX_SIZE_32)
#define ETH_BLEN_MAX_SIZE_32              (ETH_DMASBMR_BLEN32 | ETH_BLEN_MAX_SIZE_16)
#define ETH_BLEN_MAX_SIZE_16              (ETH_DMASBMR_BLEN16 | ETH_BLEN_MAX_SIZE_8)
#define ETH_BLEN_MAX_SIZE_8               (ETH_DMASBMR_BLEN8 | ETH_BLEN_MAX_SIZE_4)
#define ETH_BLEN_MAX_SIZE_4               ETH_DMASBMR_BLEN4

/**
  * @}
  */

/** @defgroup ETH_RX_OSR_LIMIT ETH Rx maximum read outstanding request limit
  * @{
  */
#define ETH_RX_OSR_LIMIT_1 ETH_DMASBMR_RD_OSR_LMT_0
#define ETH_RX_OSR_LIMIT_2 ETH_DMASBMR_RD_OSR_LMT_1
#define ETH_RX_OSR_LIMIT_3 (ETH_DMASBMR_RD_OSR_LMT_1 | ETH_DMASBMR_RD_OSR_LMT_0)

/**
  * @}
  */

/** @defgroup ETH_TX_OSR_LIMIT ETH Tx maximum write outstanding request limit
  * @{
  */
#define ETH_TX_OSR_LIMIT_1 ETH_DMASBMR_WR_OSR_LMT_0
#define ETH_TX_OSR_LIMIT_2 ETH_DMASBMR_WR_OSR_LMT_1
#define ETH_TX_OSR_LIMIT_3 (ETH_DMASBMR_WR_OSR_LMT_1 | ETH_DMASBMR_WR_OSR_LMT_0)
/**
  * @}
  */

/** @defgroup ETH_Tx_DMA_Burst_Length ETH Tx DMA Burst Length
  * @{
  */
#define ETH_TXDMABURSTLENGTH_1BEAT          ETH_DMACxTXCR_TXPBL_1PBL
#define ETH_TXDMABURSTLENGTH_2BEAT          ETH_DMACxTXCR_TXPBL_2PBL
#define ETH_TXDMABURSTLENGTH_4BEAT          ETH_DMACxTXCR_TXPBL_4PBL
#define ETH_TXDMABURSTLENGTH_8BEAT          ETH_DMACxTXCR_TXPBL_8PBL
#define ETH_TXDMABURSTLENGTH_16BEAT         ETH_DMACxTXCR_TXPBL_16PBL
#define ETH_TXDMABURSTLENGTH_32BEAT         ETH_DMACxTXCR_TXPBL_32PBL
/**
  * @}
  */

/** @defgroup ETH_Tx_DMA_Channel_Weight ETH Tx DMA Channel Weight
  * @{
  */
#define ETH_TXCHANNELWEIGHT_1               ETH_DMACxTXCR_TCW_1
#define ETH_TXCHANNELWEIGHT_2               ETH_DMACxTXCR_TCW_2
#define ETH_TXCHANNELWEIGHT_3               ETH_DMACxTXCR_TCW_3
#define ETH_TXCHANNELWEIGHT_4               ETH_DMACxTXCR_TCW_4
#define ETH_TXCHANNELWEIGHT_5               ETH_DMACxTXCR_TCW_5
#define ETH_TXCHANNELWEIGHT_6               ETH_DMACxTXCR_TCW_6
#define ETH_TXCHANNELWEIGHT_7               ETH_DMACxTXCR_TCW_7
/**
  * @}
  */

/** @defgroup ETH_Rx_DMA_Burst_Length ETH Rx DMA Burst Length
  * @{
  */
#define ETH_RXDMABURSTLENGTH_1BEAT          ETH_DMACxRXCR_RXPBL_1PBL
#define ETH_RXDMABURSTLENGTH_2BEAT          ETH_DMACxRXCR_RXPBL_2PBL
#define ETH_RXDMABURSTLENGTH_4BEAT          ETH_DMACxRXCR_RXPBL_4PBL
#define ETH_RXDMABURSTLENGTH_8BEAT          ETH_DMACxRXCR_RXPBL_8PBL
#define ETH_RXDMABURSTLENGTH_16BEAT         ETH_DMACxRXCR_RXPBL_16PBL
#define ETH_RXDMABURSTLENGTH_32BEAT         ETH_DMACxRXCR_RXPBL_32PBL
/**
  * @}
  */

/** @defgroup ETH_DMA_Descriptor_Skip_Length ETH DMA Descriptor Skip Length
  * @{
  */
#define ETH_DMA_DESC_SKIP_LENGTH_0       ETH_DMACxCR_DSL_0BIT
#define ETH_DMA_DESC_SKIP_LENGTH_32      ETH_DMACxCR_DSL_32BIT
#define ETH_DMA_DESC_SKIP_LENGTH_64      ETH_DMACxCR_DSL_64BIT
#define ETH_DMA_DESC_SKIP_LENGTH_128     ETH_DMACxCR_DSL_128BIT

/**
  * @}
  */

/** @defgroup ETH_Queue_Operation_Mode ETH Queue Operation Mode
  * @{
  */
#define ETH_TX_QUEUE_ENABLED     ETH_MTLTXQxOMR_TXQEN_EN
#define ETH_TX_QUEUE_DISABLED    ETH_MTLTXQxOMR_TXQEN_NOT
#define ETH_TX_QUEUE_AV_ENABLED  ETH_MTLTXQxOMR_TXQEN_AVMODE

#define ETH_RX_QUEUE0_ENABLED     ETH_MACRXQC0R_RXQ0EN_GT
#define ETH_RX_QUEUE0_DISABLED    ETH_MACRXQC0R_RXQ0EN_NOT
#define ETH_RX_QUEUE0_AV_ENABLED  ETH_MACRXQC0R_RXQ0EN_AV

#define ETH_RX_QUEUE1_ENABLED     ETH_MACRXQC0R_RXQ1EN_GT
#define ETH_RX_QUEUE1_DISABLED    ETH_MACRXQC0R_RXQ1EN_NOT
#define ETH_RX_QUEUE1_AV_ENABLED  ETH_MACRXQC0R_RXQ1EN_AV
/**
  * @}
  */

/** @defgroup ETH_Transmit_Queue_Size ETH Transmit Queue Size
  * @{
  */
#define ETH_TRANSMIT_QUEUE_SIZE_256      0x00000000U
#define ETH_TRANSMIT_QUEUE_SIZE_2048     (ETH_MTLTXQxOMR_TQS_0 | ETH_MTLTXQxOMR_TQS_1 | ETH_MTLTXQxOMR_TQS_2)
#define ETH_TRANSMIT_QUEUE_SIZE_4096     (ETH_TRANSMIT_QUEUE_SIZE_2048 | ETH_MTLTXQxOMR_TQS_3)

/**
  * @}
  */

/** @defgroup ETH_Receive_Queue_Size ETH Receive Queue Size
  * @{
  */
#define ETH_RECEIVE_QUEUE_SIZE_256      0x00000000U
#define ETH_RECEIVE_QUEUE_SIZE_2048     (ETH_MTLRXQxOMR_RQS_0 | ETH_MTLRXQxOMR_RQS_1 | ETH_MTLRXQxOMR_RQS_2)
#define ETH_RECEIVE_QUEUE_SIZE_4096     (ETH_RECEIVE_QUEUE_SIZE_2048 | ETH_MTLRXQxOMR_RQS_3)

/**
  * @}
  */

/** @defgroup ETH_DMA_Interrupts ETH DMA Interrupts
  * @{
  */
#define ETH_DMA_NORMAL_IT                 ETH_DMACxIER_NIE
#define ETH_DMA_ABNORMAL_IT               ETH_DMACxIER_AIE
#define ETH_DMA_CONTEXT_DESC_ERROR_IT     ETH_DMACxIER_CDEE
#define ETH_DMA_FATAL_BUS_ERROR_IT        ETH_DMACxIER_FBEE
#define ETH_DMA_EARLY_RX_IT               ETH_DMACxIER_ERIE
#define ETH_DMA_EARLY_TX_IT               ETH_DMACxIER_ETIE
#define ETH_DMA_RX_WATCHDOG_TIMEOUT_IT    ETH_DMACxIER_RWTE
#define ETH_DMA_RX_PROCESS_STOPPED_IT     ETH_DMACxIER_RSE
#define ETH_DMA_RX_BUFFER_UNAVAILABLE_IT  ETH_DMACxIER_RBUE
#define ETH_DMA_RX_IT                     ETH_DMACxIER_RIE
#define ETH_DMA_TX_BUFFER_UNAVAILABLE_IT  ETH_DMACxIER_TBUE
#define ETH_DMA_TX_PROCESS_STOPPED_IT     ETH_DMACxIER_TXSE
#define ETH_DMA_TX_IT                     ETH_DMACxIER_TIE
/**
  * @}
  */

/** @defgroup ETH_DMA_Status_Flags ETH DMA Status Flags
  * @{
  */
#define ETH_DMA_RX_NO_ERROR_FLAG                 0x00000000U
#define ETH_DMA_TX_NO_ERROR_FLAG                 0x00000000U
#define ETH_DMA_CONTEXT_DESC_ERROR_FLAG          ETH_DMACxSR_CDE
#define ETH_DMA_FATAL_BUS_ERROR_FLAG             ETH_DMACxSR_FBE
#define ETH_DMA_EARLY_TX_IT_FLAG                 ETH_DMACxSR_ERI
#define ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG         ETH_DMACxSR_RWT
#define ETH_DMA_RX_PROCESS_STOPPED_FLAG          ETH_DMACxSR_RPS
#define ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG       ETH_DMACxSR_RBU
#define ETH_DMA_TX_PROCESS_STOPPED_FLAG          ETH_DMACxSR_TPS
/**
  * @}
  */

/** @defgroup ETH_Transmit_Mode ETH Transmit Mode
  * @{
  */
#define ETH_TRANSMITSTOREFORWARD       ETH_MTLTXQxOMR_TSF
#define ETH_TRANSMITTHRESHOLD_32       ETH_MTLTXQxOMR_TTC_32BITS
#define ETH_TRANSMITTHRESHOLD_64       ETH_MTLTXQxOMR_TTC_64BITS
#define ETH_TRANSMITTHRESHOLD_96       ETH_MTLTXQxOMR_TTC_96BITS
#define ETH_TRANSMITTHRESHOLD_128      ETH_MTLTXQxOMR_TTC_128BITS
#define ETH_TRANSMITTHRESHOLD_192      ETH_MTLTXQxOMR_TTC_192BITS
#define ETH_TRANSMITTHRESHOLD_256      ETH_MTLTXQxOMR_TTC_256BITS
#define ETH_TRANSMITTHRESHOLD_384      ETH_MTLTXQxOMR_TTC_384BITS
#define ETH_TRANSMITTHRESHOLD_512      ETH_MTLTXQxOMR_TTC_512BITS
/**
  * @}
  */

/** @defgroup ETH_Receive_Mode ETH Receive Mode
  * @{
  */
#define ETH_RECEIVESTOREFORWARD        ETH_MTLRXQxOMR_RSF
#define ETH_RECEIVETHRESHOLD8_64       ETH_MTLRXQxOMR_RTC_64BITS
#define ETH_RECEIVETHRESHOLD8_32       ETH_MTLRXQxOMR_RTC_32BITS
#define ETH_RECEIVETHRESHOLD8_96       ETH_MTLRXQxOMR_RTC_96BITS
#define ETH_RECEIVETHRESHOLD8_128      ETH_MTLRXQxOMR_RTC_128BITS
/**
  * @}
  */

