micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_eth.h
/** @defgroup ETH_State_Codes ETH States
  * @{
  */
#define HAL_ETH_STATE_RESET                0x00000000U    /*!< Peripheral not yet Initialized or disabled */
#define HAL_ETH_STATE_READY                0x00000010U    /*!< Peripheral Communication started           */
#define HAL_ETH_STATE_BUSY                 0x00000020U    /*!< an internal process is ongoing             */
#define HAL_ETH_STATE_STARTED              0x00000040U    /*!< an internal process is started             */
#define HAL_ETH_STATE_ERROR                0x000000E0U    /*!< Error State                                */
/**
  * @}
  */

/** @defgroup ETH_PTP_Config_Status ETH PTP Config Status
  * @{
  */
#define HAL_ETH_PTP_NOT_CONFIGURED        0x00000000U    /*!< ETH PTP Configuration not done */
#define HAL_ETH_PTP_CONFIGURED            0x00000001U    /*!< ETH PTP Configuration done     */
/**
  * @}
  */
#ifdef HAL_ETH_USE_PTP
/** @defgroup ETH_PTP_Update_Method ETH PTP Update Method
  * @{
  */
#define HAL_ETH_PTP_COARSE_TS_UPDATE  0x00000000U    /*!< Coarse method is used to update the system timestamp */
#define HAL_ETH_PTP_FINE_TS_UPDATE    0x00000002U    /*!< Fine method is used to update system timestamp     */
/**
  * @}
  */
/** @defgroup ETH_PTP_Snap_Type_Selection ETH PTP Snap Type Selection
  * @{
  */
#define HAL_ETH_PTP_SNAPTYPSEL_0      0x00000000U    /*!< SNAPTYPSEL 00 */
#define HAL_ETH_PTP_SNAPTYPSEL_1      0x00010000U    /*!< SNAPTYPSEL 01 */
#define HAL_ETH_PTP_SNAPTYPSEL_2      0x00020000U    /*!< SNAPTYPSEL 10 */
#define HAL_ETH_PTP_SNAPTYPSEL_3      0x00030000U    /*!< SNAPTYPSEL 11 */
/**
  * @}
  */
#endif /* HAL_ETH_USE_PTP */

/** @defgroup ETH_DMA_Channel_Number_Tx_Rx_Selection ETH DMA Channel Number Tx Rx Selection
  * @{
  */
#define ETH_DMA_CH0                 0x00000001U
#define ETH_DMA_CH1                 0x00000002U
/**
  * @}
  */
/** @defgroup ETH_DMA_Channel_Number_TxOp_RxOp_Selection ETH DMA Channel Number Tx Rx Selection Index
  * @{
  */
#define ETH_DMA_CH0_IDX             (0U)
#define ETH_DMA_CH1_IDX             (1U)

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup ETH_Exported_Macros ETH Exported Macros
  * @{
  */

/** @brief Reset ETH handle state
  * @param  __HANDLE__: specifies the ETH handle.
  * @retval None
  */
#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
#define __HAL_ETH_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                      (__HANDLE__)->gState = HAL_ETH_STATE_RESET;      \
                                                      (__HANDLE__)->MspInitCallback = NULL;             \
                                                      (__HANDLE__)->MspDeInitCallback = NULL;           \
                                                    } while(0)
#else
#define __HAL_ETH_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                      (__HANDLE__)->gState = HAL_ETH_STATE_RESET;      \
                                                    } while(0)
#endif /*USE_HAL_ETH_REGISTER_CALLBACKS */

/**
  * @brief  Enables the specified ETHERNET DMA interrupts.
  * @param  __HANDLE__   : ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __INTERRUPT__: specifies the ETHERNET DMA interrupt sources to be
  *   enabled @ref ETH_DMA_Interrupts
  * @retval None
  */
#define __HAL_ETH_DMA_CH_ENABLE_IT(__HANDLE__, __INTERRUPT__,__CH__) ((__HANDLE__)->Instance->DMA_CH[__CH__].DMACIER \
                                                                      |= (__INTERRUPT__))

/**
  * @brief  Disables the specified ETHERNET DMA interrupts.
  * @param  __HANDLE__   : ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __INTERRUPT__: specifies the ETHERNET DMA interrupt sources to be
  *   disabled. @ref ETH_DMA_Interrupts
  * @retval None
  */
#define __HAL_ETH_DMA_CH_DISABLE_IT(__HANDLE__, __INTERRUPT__, __CH__) ((__HANDLE__)->Instance->DMA_CH[__CH__].DMACIER \
                                                                        &= ~(__INTERRUPT__))

/**
  * @brief  Gets the ETHERNET DMA IT source enabled or disabled.
  * @param  __HANDLE__   : ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __INTERRUPT__: specifies the interrupt source to get . @ref ETH_DMA_Interrupts
  * @retval The ETH DMA IT Source enabled or disabled
  */
#define __HAL_ETH_DMA_CH_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__, __CH__) \
  (((__HANDLE__)->Instance->DMA_CH[__CH__].DMACIER &  (__INTERRUPT__)) == (__INTERRUPT__))

/**
  * @brief  Gets the ETHERNET DMA IT pending bit.
  * @param  __HANDLE__   : ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __INTERRUPT__: specifies the interrupt source to get . @ref ETH_DMA_Interrupts
  * @retval The state of ETH DMA IT (SET or RESET)
  */
#define __HAL_ETH_DMA_CH_GET_IT(__HANDLE__, __INTERRUPT__, __CH__) \
  (((__HANDLE__)->Instance->DMA_CH[__CH__].DMACSR &  (__INTERRUPT__)) == (__INTERRUPT__))

/**
  * @brief  Clears the ETHERNET DMA IT pending bit.
  * @param  __HANDLE__   : ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear. @ref ETH_DMA_Interrupts
  * @retval None
  */
#define __HAL_ETH_DMA_CH_CLEAR_IT(__HANDLE__, __INTERRUPT__, __CH__) ((__HANDLE__)->Instance->DMA_CH[__CH__].DMACSR \
                                                                      = (__INTERRUPT__))

/**
  * @brief  Checks whether the specified ETHERNET DMA flag is set or not.
  * @param  __HANDLE__: ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __FLAG__: specifies the flag to check. @ref ETH_DMA_Status_Flags
  * @retval The state of ETH DMA FLAG (SET or RESET).
  */
#define __HAL_ETH_DMA_GET_FLAG(__HANDLE__, __FLAG__, __CH__) (((__HANDLE__)->Instance->DMA_CH[__CH__].DMACSR &\
                                                               ( __FLAG__)) == ( __FLAG__))

/**
  * @brief  Clears the specified ETHERNET DMA flag.
  * @param  __HANDLE__: ETH Handle
  * @param  __CH__   : DMA Channel
  * @param  __FLAG__: specifies the flag to check. @ref ETH_DMA_Status_Flags
  * @retval The state of ETH DMA FLAG (SET or RESET).
  */
#define __HAL_ETH_DMA_CLEAR_FLAG(__HANDLE__, __FLAG__, __CH__) ((__HANDLE__)->Instance->DMA_CH[__CH__].DMACSR\
                                                                = ( __FLAG__))

/**
  * @brief  Enables the specified ETHERNET MTL interrupts.
  * @param  __HANDLE__   : ETH Handle
  * @param  __Q__   : MTL Queue
  * @param  __INTERRUPT__: specifies the ETHERNET MTL interrupt sources to be
  *   enabled @ref ETH_MTL_Interrupts
  * @retval None
  */

#define __HAL_ETH_MTL_Q_ENABLE_IT(__HANDLE__, __INTERRUPT__, __Q__) ((__HANDLE__)->Instance->MTL_QUEUE[__Q__].MTLQICSR \
                                                                     |= (__INTERRUPT__))

/**
  * @brief  Gets the ETHERNET MTL IT source enabled or disabled.
  * @param  __HANDLE__   : ETH Handle
  * @param  __INTERRUPT__: specifies the interrupt source to get . @ref ETH_MTL_Interrupts
  * @retval The ETH MTL IT Source enabled or disabled
  */
#define __HAL_ETH_MTL_GET_IT(__HANDLE__, __INTERRUPT__) \
  (((__HANDLE__)->Instance->MTLISR &  (__INTERRUPT__)) == (__INTERRUPT__))

/**
  * @brief  Gets the ETHERNET MTL IT pending bit.
  * @param  __HANDLE__   : ETH Handle
  * @param  __Q__   : MTL Queue
  * @param  __INTERRUPT__: specifies the interrupt source to get . @ref ETH_MTL_Interrupts
  * @retval The state of ETH MTL IT (SET or RESET)
  */
#define __HAL_ETH_MTL_Q_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__, __Q__) \
  (((__HANDLE__)->Instance->MTL_QUEUE[__Q__].MTLQICSR &  (__INTERRUPT__)) == (__INTERRUPT__))
/**
  * @brief  Disables the specified ETHERNET MTL interrupts.
  * @param  __HANDLE__   : ETH Handle
  * @param  __Q__   : MTL Queue
  * @param  __INTERRUPT__: specifies the ETHERNET MTL interrupt sources to be
  *   disabled @ref ETH_MTL_Interrupts
  * @retval None
  */

